DataProcessors/ПараметрыСоединенияСУБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ПараметрыСоединенияСУБД</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СоединениеСУБД</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыСУБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыСУБД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SQLite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MSSQLServer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MySQL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PostgreSQL</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПараметрыСоединенийСУБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ПараметрыСоединенийСУБД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтрокаСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСУБД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСУБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПараметрыСоединенияСУБД/Ext/ManagerModule.bsl
// Возвращает строку соединения по имени. 
// Аналог функции получения строки из web.config
//
Функция ПолучитьСтрокуСоединения(ИмяСоединения) Экспорт
	
	Возврат ПолучитьПараметрыСоединения(ИмяСоединения).СтрокаСоединения;
	
КонецФункции

// Возвращает тип СУБД для соединения по имени. 
// Аналог функции получения типа СУБД из web.config
//
Функция ПолучитьТипСУБД(ИмяСоединения) Экспорт
	
	ТипСУБД = ПолучитьПараметрыСоединения(ИмяСоединения).ТипСУБД;
	
	Если ТипСУБД = Перечисления.ТипыСУБД.SQLite Тогда
		Возврат 0;
	ИначеЕсли ТипСУБД = Перечисления.ТипыСУБД.MSSQLServer Тогда
		Возврат 1;
	ИначеЕсли ТипСУБД = Перечисления.ТипыСУБД.MySQL Тогда
		Возврат 2;
	ИначеЕсли ТипСУБД = Перечисления.ТипыСУБД.PostgreSQL Тогда
		Возврат 3;
	Иначе
		ВызватьИсключение "Неизвестный тип СУБД";
	КонецЕсли;

	
КонецФункции

Функция ПолучитьПараметрыСоединения(ИмяСоединения)
	
	Параметры = Справочники.ПараметрыСоединенийСУБД.НайтиПоКоду(ИмяСоединения);
	
	Если Параметры = Справочники.ПараметрыСоединенийСУБД.ПустаяСсылка() Тогда
		ВызватьИсключение "Строка соединения не найдена";
	КонецЕсли;
	
	Возврат Параметры;

КонецФункции
